tiborsimon/embedded-tdd-headers/pic/8bit/pic18f86j93_tdd.h
#define RC2IE                         1091
#define LCDIE                         1092
#define PIR3                          1093
#define RTCCIF                        1094
#define RXBNIF                        1095
#define CCP1IF                        1096
#define CCP2IF                        1097
#define CTMUIF                        1098
#define TXBNIF                        1099
#define TX2IF                         1100
#define RC2IF                         1101
#define LCDIF                         1102
#define IPR3                          1103
#define RTCCIP                        1104
#define CCP1IP                        1105
#define RXBNIP                        1106
#define CCP2IP                        1107
#define CTMUIP                        1108
#define TX2IP                         1109
#define TXBNIP                        1110
#define RC2IP                         1111
#define LCDIP                         1112
#define EECON1                        1113
#define WR                            1114
#define WREN                          1115
#define WRERR                         1116
#define FREE                          1117
#define WPROG                         1118
#define EECON2                        1119
#define LCDCON                        1120
#define LMUX0                         1121
#define LMUX1                         1122
#define CS0                           1123
#define LCDCS0                        1124
#define CS1                           1125
#define LCDCS1                        1126
#define WERR                          1127
#define LCDWERR                       1128
#define LCDSLPEN                      1129
#define SLPEN                         1130
#define LCDEN                         1131
#define LCDSE0                        1132
#define SE0                           1133
#define SEGEN0                        1134
#define SE00                          1135
#define SE1                           1136
#define SEGEN1                        1137
#define SE01                          1138
#define SE2                           1139
#define SEGEN2                        1140
#define SE02                          1141
#define SE3                           1142
#define SEGEN3                        1143
#define SE03                          1144
#define SE4                           1145
#define SEGEN4                        1146
#define SE04                          1147
#define SE5                           1148
#define SE05                          1149
#define SEGEN5                        1150
#define SE6                           1151
#define SE06                          1152
#define SEGEN6                        1153
#define SE07                          1154
#define SE7                           1155
#define SEGEN7                        1156
#define LCDPS                         1157
#define LP0                           1158
#define LCDPS0                        1159
#define LP1                           1160
#define LCDPS1                        1161
#define LP2                           1162
#define LCDPS2                        1163
#define LP3                           1164
#define LCDPS3                        1165
#define WA                            1166
#define LCDA                          1167
#define BIASMD                        1168
#define WFT                           1169
#define RCSTA1                        1170
#define RCSTA1_RX9D                   1171
#define RX9D1                         1172
#define RCSTA1_RCD8                   1173
#define RCSTA1_OERR                   1174
#define OERR1                         1175
#define RCSTA1_FERR                   1176
#define FERR1                         1177
#define RCSTA1_ADDEN                  1178
#define ADDEN1                        1179
#define ADEN                          1180
#define RCSTA1_CREN                   1181
#define CREN1                         1182
#define SRENA                         1183
#define SREN1                         1184
#define RCSTA1_SREN                   1185
#define RCSTA1_NOT_RC8                1186
#define RCSTA1_RC9                    1187
#define RCSTA1_RC8_9                  1188
#define RCSTA1_RX9                    1189
#define nRC8                          1190
#define RX91                          1191
#define RCSTA1_SPEN                   1192
#define SPEN1                         1193
#define TXSTA1                        1194
#define TX9D1                         1195
#define TXSTA1_TX9D                   1196
#define TXSTA1_TXD8                   1197
#define TRMT1                         1198
#define TXSTA1_TRMT                   1199
#define BRGH1                         1200
#define TXSTA1_BRGH                   1201
#define SENDB1                        1202
#define SENDB                         1203
#define TXSTA1_SYNC                   1204
#define SYNC1                         1205
#define TXEN1                         1206
#define TXSTA1_TXEN                   1207
#define TX91                          1208
#define TXSTA1_NOT_TX8                1209
#define TXSTA1_TX8_9                  1210
#define TXSTA1_TX9                    1211
#define nTX8                          1212
#define TXSTA1_CSRC                   1213
#define CSRC1                         1214
#define TXREG1                        1215
#define RCREG1                        1216
#define SPBRG1                        1217
#define T3CON                         1218
#define TMR3ON                        1219
#define TMR3CS                        1220
#define T3INSYNC                      1221
#define nT3SYNC                       1222
#define NOT_T3SYNC                    1223
#define T3SYNC                        1224
#define SOSCEN3                       1225
#define T3CCP1                        1226
#define T3CKPS                        1227
#define T3CKPS0                       1228
#define T3CKPS1                       1229
#define T3CCP2                        1230
#define T3CON_RD16                    1231
#define RD163                         1232
#define T3RD16                        1233
#define TMR3L                         1234
#define TMR3H                         1235
#define CMCON                         1236
#define CMEN0                         1237
#define CMCON_CM                      1238
#define CM0                           1239
#define CMEN1                         1240
#define CM1                           1241
#define CMEN2                         1242
#define CM2                           1243
#define CIS                           1244
#define C1INV                         1245
#define C2INV                         1246
#define CMCON_C1OUT                   1247
#define CMCON_C2OUT                   1248
#define CVRCON                        1249
#define CVR                           1250
#define CVR0                          1251
#define CVR1                          1252
#define CVR2                          1253
#define CVR3                          1254
#define CVRSS                         1255
#define CVRR                          1256
#define CVROEN                        1257
#define CVROE                         1258
#define CVREN                         1259
#define SE08                          1260
#define SE8                           1261
#define SEGEN8                        1262
#define LCDSE1                        1263
#define SEGEN9                        1264
#define SE09                          1265
#define SE9                           1266
#define SEGEN10                       1267
#define SE10                          1268
#define SEGEN11                       1269
#define SE11                          1270
#define SEGEN12                       1271
#define SE12                          1272
#define SEGEN13                       1273
#define SE13                          1274
#define SEGEN14                       1275
#define SE14                          1276
#define SEGEN15                       1277
#define SE15                          1278
#define SEGEN16                       1279
#define LCDSE2                        1280
#define SE16                          1281
#define SEGEN17                       1282
#define SE17                          1283
#define SEGEN18                       1284
#define SE18                          1285
#define SEGEN19                       1286
#define SE19                          1287
#define SE20                          1288
#define SEGEN20                       1289
#define SE21                          1290
#define SEGEN21                       1291
#define SEGEN22                       1292
#define SE22                          1293
#define SEGEN23                       1294
#define SE23                          1295
#define SE24                          1296
#define SEGEN24                       1297
#define LCDSE3                        1298
#define SE25                          1299
#define SEGEN25                       1300
#define SE26                          1301
#define SEGEN26                       1302
#define SE27                          1303
#define SEGEN27                       1304
#define SE28                          1305
#define SEGEN28                       1306
#define SEGEN29                       1307
#define SE29                          1308
#define SE30                          1309
#define SEGEN30                       1310
#define SEGEN31                       1311
#define SE31                          1312
#define SE32                          1313
#define SEGEN32                       1314
#define LCDSE4                        1315
#define SE33                          1316
#define SEGEN33                       1317
#define SE34                          1318
#define SEGEN34                       1319
#define SE35                          1320
#define SEGEN35                       1321
#define SE36                          1322
#define SEGEN36                       1323
#define SE37                          1324
#define SEGEN37                       1325
#define SE38                          1326
#define SEGEN38                       1327
#define SE39                          1328
#define SEGEN39                       1329
#define SE40                          1330
#define SEGEN40                       1331
#define LCDSE5                        1332
#define SE41                          1333
#define SEGEN41                       1334
#define SE42                          1335
#define SEGEN42                       1336
#define SE43                          1337
#define SEGEN43                       1338
#define SE44                          1339
#define SEGEN44                       1340
#define SEGEN45                       1341
#define SE45                          1342
#define SE46                          1343
#define SEGEN46                       1344
#define SE47                          1345
#define SEGEN47                       1346
#define SEG0COM0                      1347
#define LCDDATA0                      1348
#define S00C0                         1349
#define S0C0                          1350
#define S01C0                         1351
#define SEG1COM0                      1352
#define S1C0                          1353
#define S02C0                         1354
#define S2C0                          1355
#define SEG2COM0                      1356
#define S03C0                         1357
#define SEG3COM0                      1358
#define S3C0                          1359
#define SEG4COM0                      1360
#define S4C0                          1361
#define S04C0                         1362
#define S5C0                          1363
#define S05C0                         1364
#define SEG5COM0                      1365
#define SEG6COM0                      1366
#define S6C0                          1367
#define S06C0                         1368
#define SEG7COM0                      1369
#define S7C0                          1370
#define S07C0                         1371
#define S08C0                         1372
#define LCDDATA1                      1373
#define S8C0                          1374
#define SEG8COM0                      1375
#define SEG9COM0                      1376
#define S09C0                         1377
#define S9C0                          1378
#define S10C0                         1379
#define SEG10COM0                     1380
#define S11C0                         1381
#define SEG11COM0                     1382
#define S12C0                         1383
#define SEG12COM0                     1384
#define S13C0                         1385
#define SEG13COM0                     1386
#define S14C0                         1387
#define SEG14COM0                     1388
#define SEG15COM0                     1389
#define S15C0                         1390
#define LCDDATA2                      1391
#define S16C0                         1392
#define SEG16COM0                     1393
#define SEG17COM0                     1394
#define S17C0                         1395
#define SEG18COM0                     1396
#define S18C0                         1397
#define S19C0                         1398
#define SEG19COM0                     1399
#define S20C0                         1400
#define SEG20COM0                     1401
#define S21C0                         1402
#define SEG21COM0                     1403
#define SEG22COM0                     1404
#define S22C0                         1405
#define S23C0                         1406
#define SEG23COM0                     1407
#define LCDDATA3                      1408
#define S24C0                         1409
#define SEG24COM0                     1410
#define S25C0                         1411
#define SEG25COM0                     1412
#define S26C0                         1413
#define SEG26COM0                     1414
#define SEG27COM0                     1415
#define S27C0                         1416
#define SEG28COM0                     1417
#define S28C0                         1418
#define SEG29COM0                     1419
#define S29C0                         1420
#define S30C0                         1421
#define SEG30COM0                     1422
#define SEG31COM0                     1423
#define S31C0                         1424
#define S32C0                         1425
#define LCDDATA4                      1426
#define SEG32COM0                     1427
#define SEG33COM0                     1428
#define S33C0                         1429
#define S34C0                         1430
#define SEG34COM0                     1431
#define S35C0                         1432
#define SEG35COM0                     1433
#define S36C0                         1434
#define SEG36COM0                     1435
#define SEG37COM0                     1436
#define S37C0                         1437
#define S38C0                         1438
#define SEG38COM0                     1439
#define SEG39COM0                     1440
#define S39C0                         1441
#define ADCON2                        1442
#define ADCS0                         1443
#define ADCS                          1444
#define ADCS1                         1445
#define ADCS2                         1446
#define ACQT0                         1447
#define ACQT                          1448
#define ACQT1                         1449
#define ACQT2                         1450
#define ADFM                          1451
#define ADCON1                        1452
#define PCFG0                         1453
#define PCFG                          1454
#define PCFG1                         1455
#define PCFG2                         1456
#define CHSN3                         1457
#define PCFG3                         1458
#define VCFG                          1459
#define VCFG0                         1460
#define VCFG01                        1461
#define VCFG11                        1462
#define VCFG1                         1463
#define TRIGSEL                       1464
#define ADCON0                        1465
#define ADON                          1466
#define nDONE                         1467
#define GO_nDONE                      1468
#define NOT_DONE                      1469
#define GODONE                        1470
#define GO_DONE                       1471
#define DONE                          1472
#define GO                            1473
#define GO_NOT_DONE                   1474
#define CHS                           1475
#define CHS0                          1476
#define CHS1                          1477
#define CHS2                          1478
#define CHS3                          1479
#define ADCAL                         1480
#define ADRESL                        1481
#define ADRESH                        1482
#define SSP1CON2                      1483
#define SEN1                          1484
#define SEN                           1485
#define ADMSK11                       1486
#define RSEN1                         1487
#define SSP1CON2_ADMSK1               1488
#define RSEN                          1489
#define PEN                           1490
#define ADMSK21                       1491
#define PEN1                          1492
#define SSP1CON2_ADMSK2               1493
#define ADMSK31                       1494
#define RCEN                          1495
#define RCEN1                         1496
#define SSP1CON2_ADMSK3               1497
#define ACKEN                         1498
#define ACKEN1                        1499
#define ADMSK41                       1500
#define SSP1CON2_ADMSK4               1501
#define ACKDT1                        1502
#define ADMSK51                       1503
#define SSP1CON2_ADMSK5               1504
#define ACKDT                         1505
#define ACKSTAT                       1506
#define ACKSTAT1                      1507
#define GCEN                          1508
#define GCEN1                         1509
#define SSP1CON1                      1510
#define SSPM0                         1511
#define SSPM                          1512
#define SSPM01                        1513
#define SSPM1                         1514
#define SSPM11                        1515
#define SSPM2                         1516
#define SSPM21                        1517
#define SSPM31                        1518
#define SSPM3                         1519
#define CKP                           1520
#define CKP1                          1521
#define SSPEN                         1522
#define SSPEN1                        1523
#define SSPOV1                        1524
#define SSPOV                         1525
#define WCOL1                         1526
#define WCOL                          1527
#define SSP1STAT                      1528
#define BF                            1529
#define BF1                           1530
#define UA1                           1531
#define UA                            1532
#define R_NOT_W                       1533
#define READ_WRITE                    1534
#define RW1                           1535
#define NOT_W                         1536
#define I2C_READ                      1537
#define nW                            1538
#define RW                            1539
#define nWRITE                        1540
#define R                             1541
#define NOT_WRITE                     1542
#define R_nW                          1543
#define R_W                           1544
#define START                         1545
#define START1                        1546
#define S                             1547
#define I2C_START                     1548
#define STOP                          1549
#define STOP1                         1550
#define I2C_STOP                      1551
#define P                             1552
#define NOT_A                         1553
#define nA                            1554
#define D_A                           1555
#define D_nA                          1556
#define D                             1557
#define DA1                           1558
#define DA                            1559
#define DATA_ADDRESS                  1560
#define D_NOT_A                       1561
#define NOT_ADDRESS                   1562
#define nADDRESS                      1563
#define I2C_DAT                       1564
#define CKE                           1565
#define CKE1                          1566
#define SMP                           1567
#define SMP1                          1568
#define SSP1ADD                       1569
#define SSP1ADD_MSK0                  1570
#define MSK01                         1571
#define SSPADD                        1572
#define SSP1ADD_MSK1                  1573
#define MSK11                         1574
#define SSP1ADD_MSK2                  1575
#define MSK21                         1576
#define MSK31                         1577
#define SSP1ADD_MSK3                  1578
#define SSP1ADD_MSK4                  1579
#define MSK41                         1580
#define MSK51                         1581
#define SSP1ADD_MSK5                  1582
#define MSK61                         1583
#define SSP1ADD_MSK6                  1584
#define SSP1ADD_MSK7                  1585
#define MSK71                         1586
#define SSP1BUF                       1587
#define SSPBUF                        1588
#define T2CON                         1589
#define T2CKPS0                       1590
#define T2CKPS                        1591
#define T2CKPS1                       1592
#define TMR2ON                        1593
#define T2OUTPS0                      1594
#define T2OUTPS                       1595
#define T2OUTPS1                      1596
#define T2OUTPS2                      1597
#define T2OUTPS3                      1598
#define WM0                           1599
#define PR2                           1600
#define WM1                           1601
#define WAIT0                         1602
#define WAIT1                         1603
#define EBDIS                         1604
#define TMR2                          1605
#define T1CON                         1606
#define TMR1ON                        1607
#define TMR1CS                        1608
#define NOT_T1SYNC                    1609
#define T1SYNC                        1610
#define nT1SYNC                       1611
#define T1INSYNC                      1612
#define T1OSCEN                       1613
#define SOSCEN                        1614
#define T1CKPS0                       1615
#define T1CKPS                        1616
#define T1CKPS1                       1617
#define T1RUN                         1618
#define T1RD16                        1619
#define T1CON_RD16                    1620
#define TMR1L                         1621
#define TMR1H                         1622
#define RCON                          1623
#define BOR                           1624
#define NOT_BOR                       1625
#define nBOR                          1626
#define POR                           1627
#define nPOR                          1628
#define NOT_POR                       1629
#define PD                            1630
#define nPD                           1631
#define NOT_PD                        1632
#define nTO                           1633
#define TO                            1634
#define NOT_TO                        1635
#define nRI                           1636
#define NOT_RI                        1637
#define RI                            1638
#define NOT_CM                        1639
#define RCON_CM                       1640
#define nCM                           1641
#define IPEN                          1642
#define WDTCON                        1643
#define SWDTE                         1644
#define SWDTEN                        1645
#define REGSLP                        1646
#define LCDREG                        1647
#define CKSEL                         1648
